{"lp": "en-nl", "domain": "social", "document_id": "test-en-social_112289379466442912", "segment_id": 654, "is_bad_source": false, "source": "Does this make sense? Would this be useful?", "target": "Slaat dat ergens op? Zou dat nuttig zijn?", "original_target": "Slaat dat ergens op? Zou dat nuttig zijn?", "difficulty_score": 0.5294290781021118}
{"lp": "en-de", "domain": "social", "document_id": "test-en-social_112112980319428992", "segment_id": 418, "is_bad_source": false, "source": "I’m splurging on a new set of frames, these red ones I reeeeally like.", "target": "Ich gönn mir ein neues Gestell, dieses rote, das gefällt mir wirklich.", "original_target": "Ich gönne mir ein neues Gestell, dieses rote, das mir wirklich gefällt.", "difficulty_score": 0.15051892399787903}
{"lp": "en-zh", "domain": "social", "document_id": "test-en-social_112122127346453600", "segment_id": 459, "is_bad_source": false, "source": "Chapter five is a long one, but so fucking angsty. Yisssss, the good shit.", "target": "第五章篇幅很长，让人超级焦虑。耶！真是太带劲了。", "original_target": "第五章很长，让人焦虑。一堆狗屎。", "difficulty_score": 0.13773342967033386}
{"lp": "en-es", "domain": "news", "document_id": "test-en-news_newsweek.63908", "segment_id": 46, "is_bad_source": false, "source": "However, with that deadline just 9 days away, Senate Republican Leader Mitch McConnell has said Congress will need to pass a CR to keep things open, meaning the speaker may soon break a promise he made, largely to appease his right flank. Such a maneuver could ignite a heated ideological battle in a closely divided House over the GOP's role in spending cuts that may see the government face a partial shutdown or Johnson removed from his job.", "target": "Sin embargo, con esa fecha límite a tan solo 9 días, el líder republicano en el senado Mitch McConnell afirmó que el Congreso deberá aprobar una CR para mantener abierto el gobierno, refiriéndose a que el presidente de la Cámara podría romper próximamente una promesa que hizo en gran medida para tranquilizar a los conservadores. Semejante maniobra podría desatar una acalorada batalla ideológica en una cámara altamente dividida sobre el papel del Partido Republicano en los recortes de gastos, desencadenando un cierre parcial del gobierno o el cese de Johnson.", "original_target": "Sin embargo, con esa fecha límite a tan sólo 9 días, el líder republicano en el senado Mitch McConnel ha declarado que el Congreso deberá aprobar una CR para mantener los cosas abiertas, refiriéndose a que el presidente podría romper próximamente una promesa que hizo en gran medida para tranquilizar a los conservadores. Semejante maniobra podría desatar una acalorada batalla ideológica en una cámara altamente dividida sobre el papel del Partido Republicano en los recortes de gastos desencadenando un cierre parcial del gobierno o el cese de Johnson.", "difficulty_score": -0.10066480189561844}
{"lp": "en-nl", "domain": "news", "document_id": "test-en-news_scotsman.87519", "segment_id": 114, "is_bad_source": false, "source": "As has been pointed out for years by, among others, The Scotsman, the wrongful conviction of hundreds of Post Office branch managers in the Horizon scandal is one of the most serious miscarriages of justice in history. People were sent to prison, lost homes, marriages and reputations, and endured the mental torment of an honest person treated as a criminal.", "target": "Zoals onder andere The Scotsman al jarenlang zegt, is de onrechtmatige veroordeling van honderden filiaalmanagers van Britse postkantoren in het Horizon-schandaal een van de ernstigste gerechtelijke dwalingen uit de geschiedenis. Mensen kregen gevangenisstraffen, verloren hun huis en reputatie en huwelijken strandden. Eerlijke mensen raakten mentaal getormenteerd omdat ze als crimineel behandeld werden.", "original_target": "Zoals al jaren geroepen wordt door, onder anderen, The Scotsman, is de onrechtmatige veroordeling van honderden filiaalmanagers van Britse postkantoren in het Horizon-schandaal een van de ernstigste dwalingen van het gerecht in de geschiedenis. Mensen zijn naar de gevangenis gestuurd, raakten hun woning, huwelijk en reputatie kwijt, en moesten als eerlijk mens de geestelijke kwelling zien te doorstaan om als een crimineel behandeld te worden.", "difficulty_score": 0.08103300631046295}
{"lp": "en-de", "domain": "social", "document_id": "test-en-social_112122127346453600", "segment_id": 461, "is_bad_source": false, "source": "But no, I stand by it. Most natural speech is broken up, especially when people get emotional.", "target": "Aber nein, ich bleibe dabei. Natürliche Sprache ist meistens abgehackt, besonders wenn man emotional wird.", "original_target": "Aber nein, ich bleibe dabei. Natürliche Sprache ist meistens nicht flüssig, besonders wenn jemand emotional wird.", "difficulty_score": 0.2664526700973511}
{"lp": "en-zh", "domain": "social", "document_id": "test-en-social_112270350852000848", "segment_id": 630, "is_bad_source": false, "source": "We always start with a rough pencil sketch…", "target": "我们通常会先画一幅粗略的铅笔草图……", "original_target": "我们总是先用铅笔画出草图……", "difficulty_score": 0.4672069549560547}
{"lp": "en-es", "domain": "social", "document_id": "test-en-social_112166537145572640", "segment_id": 576, "is_bad_source": false, "source": "“get simple, semantic classes simply by using these two libraries and a build tool”", "target": "“obtén clases semánticas simples con tan solo usar estas dos bibliotecas y una herramienta de compilación”", "original_target": "\"Obtén clases semánticas simples con tan sólo usar estas dos bibliotecas y una herramienta de compilación\".", "difficulty_score": 0.43065619468688965}
{"lp": "en-nl", "domain": "news", "document_id": "test-en-news_economist.14223", "segment_id": 25, "is_bad_source": false, "source": "Thomas Puls of IW Köln fears that the strikes will harm the image of Germany as a place for business. Local bosses are already fretting about a German version of the gilets jaunes protests in France in 2018, which culminated in yellow-jacketed demonstrators torching cars on the Champs-Elysées and the police stepping in with tear gas. Jochen Kopelke, head of Germany's police union, warned in an interview with Tagesspiegel, a daily, that the farmers were probably \"just the start of an enormous wave of protest this year.\" Germany was the only big economy to shrink in 2023, and the year ended on an especially sour note, with an unexpected drop in business confidence in December. This year is shaping up to be even tougher.", "target": "Thomas Puls van IW Köln is bang dat de stakingen het imago van Duitsland als ondernemingsland zullen schaden. Lokale werkgevers zijn nu al bang voor een mogelijke Duitse versie van de protesten in Frankrijk in 2018, waarbij demonstranten in gele hesjes auto's in brand staken op de Champs-Elysées en de politie moest ingrijpen met traangas. In een interview met het dagblad Tagespiegel waarschuwde Jochen Kopelke, voorzitter van de Duitse politievakbond, dat \"de boerenprotesten waarschijnlijk slechts de voorbode zijn van een enorme golf van protesten dit jaar\". In 2023 was Duitsland de enige grote economie die kromp en in december bleek zelfs dat het vertrouwen onder ondernemers onverwachts gedaald is. Dit jaar belooft daarom nog moeilijker te worden.", "original_target": "Thomas Puls van IW Köln is bang dat de stakingen het imago van Duitsland als zakenland zullen schaden. Lokale werkgevers zijn nu al bang voor een mogelijke Duitse versie van de protesten in Frankrijk in 2018, toen demonstranten in gele hesjes uiteindelijk auto's in brand staken op de Champs-Elysées en de politie moest ingrijpen met traangas. Jochen Kopelke, voorzitter van de Duitse politievakbond, waarschuwde in een interview met het dagblad Tagesspiegel dat de boeren \"waarschijnlijk slechts de voorbode waren van een enorme golf van protesten dit jaar\". Duitsland was de enige grote economie die in 2023 kromp en het jaar eindigde bijzonder zuur toen het vertrouwen onder ondernemers in december onverwachts daalde. Dit jaar belooft nog moeilijker te worden.", "difficulty_score": -0.3332027792930603}
{"lp": "en-de", "domain": "speech", "document_id": "test-en-speech_33gJqN796Eo_000", "segment_id": 705, "is_bad_source": false, "source": "Well, it still sounds better than Pink Floyd. So in Manic Miner, you collect all the items on the screen and head to the goal. And you gotta do it before you run out of air or hit something. Hit what exactly? Weeds! You can die from touching grass. It sounds like half my fanbase. And did you notice I died from touching a weed that was on a completely different platform? I just went through the platform and then hit the weed. That's good game design, man. And then there's this asshole over here who's going rrrrr!", "target": "Naja, es klingt immer noch besser als Pink Floyd. In Manic Miner kannst du also alle Gegenstände auf dem Bildschirm sammeln und zum Ziel gehen. Und das tust du besser, bevor dir die Luft ausgeht oder ein Hindernis berührst. Und was genau? Unkraut! Du kannst sterben, wenn du Gras berührst. Das klingt nach der Hälfte meiner Fans. Und habt ihr gesehen, dass ich gestorben bin, weil ich Unkraut berührt hab, das auf einer ganz anderen Plattform war? Ich bin einfach durch die Plattform durch und hab das Unkraut berührt. Das ist tolles Spieldesign. Und dann ist dort drüben dieses Arschloch, das rrrrr macht!", "original_target": "Naja, es klingt immer noch besser als Pink Floyd. In Manic Miner kannst du also alle Artikel auf dem Bildschirm sammeln und zum Ziel gehen. Und das tust du besser, bevor dir die Luft ausgeht oder du auf ein Hindernis stößt. Auf was genau? Unkraut! Du kannst sterben, wenn du Gras berührst. Das klingt nach der Hälfte meiner Fans. Und hast du gemerkt, dass ich durch die Berührung eines Unkrauts starb, das sich auf einer ganz anderen Plattform befand? Ich ging einfach durch die Plattform und traf auf das Unkraut. Das ist tolles Spieldesign, Mensch. Und dann ist dort drüben dieses Arschloch, das rrrrr macht!", "difficulty_score": -2.841447114944458}
{"lp": "en-zh", "domain": "news", "document_id": "test-en-news_beverly_press.3585", "segment_id": 5, "is_bad_source": false, "source": "The Tierra del Sol Gallery is located at 7414 Santa Monica Blvd. For information, visit tierradelsolgallery.org.", "target": "Tierra del Sol 画廊位于圣莫尼卡大道 7414 号。更多信息请访问 tierradelsolgallery.org。", "original_target": "Tierra del Sol画廊位于圣莫尼卡大道7414号。如需了解更多信息，请访问tierradelsolgallery.org。", "difficulty_score": 0.4086627960205078}
{"lp": "en-es", "domain": "literary", "document_id": "test-en-literary_forever_snow_chunk_1_words_993", "segment_id": 884, "is_bad_source": false, "source": "“Why are they doing this to her?”", "target": "“¿Por qué le están haciendo esto?”.", "original_target": "\"¿Por qué le están haciendo esto?\"", "difficulty_score": 0.5199424624443054}
{"lp": "en-nl", "domain": "speech", "document_id": "test-en-speech_OPV8Gf1FFn8_021", "segment_id": 759, "is_bad_source": false, "source": "Mom says you don't want to visit us. She says that? Yeah. Everybody's got a story, son. I guess that's hers. Life's funny that way, you know?", "target": "Mama zegt dat je ons niet wil bezoeken. Zegt ze dat? Ja. Er zit een verhaal achter iedereen, jongen. Blijkbaar is dat haar verhaal. Weet je, soms loopt het leven anders dan je denkt.", "original_target": "Mama zegt dat je ons niet wil bezoeken. Zegt ze dat? Ja. Iedereen heeft een verhaal te vertellen, zoon. Blijkbaar is dat haar verhaal. Soms pakt het leven gewoon grappig uit, weet je wel?", "difficulty_score": 0.2372959405183792}
{"lp": "en-de", "domain": "social", "document_id": "test-en-social_112226149509052560", "segment_id": 608, "is_bad_source": false, "source": "Final edit: that level turned out to be a tool assisted upload, which no one thought was possible at the time but apparently it was! But people still persisted and it got beat in the end! https://fgc.network/objects/0f1b42c6-cbb1-49bb-91f5-db81bc71ea14", "target": "Letzter Nachtrag: Es hat sich rausgestellt, dass dieses Level mit Tool-Unterstützung hochgeladen wurde, was damals niemand für möglich hielt, aber offensichtlich ging es. Aber die Spieler ließen nicht locker, und am Ende hat es jemand geschafft! https://fgc.network/objects/0f1b42c6-cbb1-49bb-91f5-db81bc71ea14", "original_target": "Letzter Nachtrag: Es hat sich herausgestellt, dass dieses Level mit Tool-Unterstützung hochgeladen wurde, was damals niemand für möglich hielt, aber offensichtlich war es so. Aber die Spieler ließen nicht locker, und am Ende hat es jemand geschafft! https://fgc.network/objects/0f1b42c6-cbb1-49bb-91f5-db81bc71ea14", "difficulty_score": -0.7442566752433777}
{"lp": "en-zh", "domain": "literary", "document_id": "test-en-literary_forever_snow_chunk_2_words_986", "segment_id": 927, "is_bad_source": false, "source": "“Well I didn’t.” Ivory found the art supplies on their list and put it in a crate that they found. “And I’m not a girl.”", "target": "“我可不想。”艾弗里找到了清单上的美术用品，并把它们放进一个箱子里。“而且，我也不是女孩。”", "original_target": "“但我不想。” 艾弗里找到了清单上的美术用品，并把它放到一个箱子里。“而且我也不是女孩。”", "difficulty_score": 0.06535331904888153}
{"lp": "en-es", "domain": "social", "document_id": "test-en-social_111977766001055104", "segment_id": 226, "is_bad_source": false, "source": "Moon landing time (about an hour to go) https://plus.nasa.gov/scheduled-video/intuitive-machines-1-lunar-landing/", "target": "Hora del alunizaje (falta aproximadamente una hora) https://plus.nasa.gov/scheduled-video/intuitive-machines-1-lunar-landing/", "original_target": "Hora del alunizaje (falta aproximadamente una hora) https://plus.nasa.gov/scheduled-video/intuitive-machines-1-lunar-landing/", "difficulty_score": 0.1451055109500885}
{"lp": "en-nl", "domain": "social", "document_id": "test-en-social_112109186993725712", "segment_id": 281, "is_bad_source": false, "source": "This is the state of my upstairs bathroom right now.", "target": "Dit is hoe mijn badkamer boven er nu uitziet.", "original_target": "Dit is hoe mijn badkamer boven er nu uitziet.", "difficulty_score": 0.4389936923980713}
{"lp": "en-de", "domain": "social", "document_id": "test-en-social_112140958167999904", "segment_id": 481, "is_bad_source": false, "source": "It's my first ever crown dentist visit: Prep today, then fitting in a fortnight. I'm practising opening my mouth wide.", "target": "Das ist mein allererster Zahnarztbesuch wegen einer Krone: Heute war die Vorbereitung. In zwei Wochen ist dann die Anpassung. Ich übe schon mal, meinen Mund weit aufzumachen.", "original_target": "Das ist mein allererster Zahnarztbesuch wegen einer Krone: Heute war die Vorbereitung. In zwei Wochen ist dann die Anpassung. Ich übe schon mal, meinen Mund weit aufzumachen.", "difficulty_score": -0.23201410472393036}
{"lp": "en-zh", "domain": "news", "document_id": "test-en-news_scotsman.87445", "segment_id": 81, "is_bad_source": false, "source": "If anyone dares to say that Scotland's NHS is not in a state of crisis or that these are just the usual winter problems, we should be outraged. The danger is that politicians like the embattled Health Secretary, Michael Matheson, will succeed in their efforts to convince us that, while regrettable, this is somehow acceptable, that there is nothing more that ministers can do in the circumstances, that this is the new normal.", "target": "如果有人胆敢声称苏格兰的 NHS 体系并未陷入危机，或者说这些只是冬季的常见问题，我们都应该感到愤怒。危险在于，像陷入困境的卫生大臣迈克尔·马西森这样的政客会成功地让我们相信，虽然这令人遗憾，但在某种程度上是可以接受的，部长们在目前情况下也无能为力，这就是新的常态。", "original_target": "如果有人敢说苏格兰的国民医疗服务体系并未陷入危机，或者这些只是冬季常见的问题，我们就应该感到愤怒。危险在于，像四面楚歌的卫生部长迈克尔·马西森之类的政客试图说服我们，这种情况虽然令人遗憾，但这在某种程度上是可以接受的，部长们也无能为力，这是新的常态。", "difficulty_score": 0.15169908106327057}
{"lp": "en-es", "domain": "speech", "document_id": "test-en-speech_OPV8Gf1FFn8_021", "segment_id": 759, "is_bad_source": false, "source": "Mom says you don't want to visit us. She says that? Yeah. Everybody's got a story, son. I guess that's hers. Life's funny that way, you know?", "target": "Mamá dice que no quieres visitarnos. ¿Eso dice? Sí. Todo el mundo tiene una historia, hijo. Supongo que ésa es la suya. La vida es así de curiosa, ¿sabes?", "original_target": "Mamá dice que no quieres visitarnos. ¿Eso dice? Si. Todo el mundo tiene una historia, hijo. Supongo que ésa es la suya. La vida es así de curiosa, ¿sabes?", "difficulty_score": 0.2372959405183792}
