{"lp": "en-es", "domain": "social", "document_id": "test-en-social_112289379466442912", "segment_id": 654, "is_bad_source": false, "source": "Does this make sense? Would this be useful?", "target": "¿Tiene sentido? ¿Sería útil?", "original_target": "¿Tiene sentido? ¿Sería útil?", "difficulty_score": 0.5294290781021118}
{"lp": "en-zh", "domain": "social", "document_id": "test-en-social_112112980319428992", "segment_id": 418, "is_bad_source": false, "source": "I’m splurging on a new set of frames, these red ones I reeeeally like.", "target": "我花大价钱买了一副新镜框，这副红色的我很喜欢。", "original_target": "我花高价买了一副新镜框，是我非常喜欢的红色镜框。", "difficulty_score": 0.15051892399787903}
{"lp": "en-nl", "domain": "social", "document_id": "test-en-social_112122127346453600", "segment_id": 459, "is_bad_source": false, "source": "Chapter five is a long one, but so fucking angsty. Yisssss, the good shit.", "target": "Hoofdstuk vijf wordt lang, maar echt vreselijk eng. Yes! Bizar goed.", "original_target": "Hoofstuk vijf wordt een lange, maar echt aangrijpend. Yes, het goede spul.", "difficulty_score": 0.13773342967033386}
{"lp": "en-de", "domain": "news", "document_id": "test-en-news_newsweek.63908", "segment_id": 46, "is_bad_source": false, "source": "However, with that deadline just 9 days away, Senate Republican Leader Mitch McConnell has said Congress will need to pass a CR to keep things open, meaning the speaker may soon break a promise he made, largely to appease his right flank. Such a maneuver could ignite a heated ideological battle in a closely divided House over the GOP's role in spending cuts that may see the government face a partial shutdown or Johnson removed from his job.", "target": "Angesichts der Tatsache, dass dieser Termin nur noch neun Tage entfernt ist, hat der Fraktionschef der Republikaner im Senat, Mitch McConnell, angekündigt, dass der Kongress eine „Continuing Resolution“ verabschieden muss, um die Regierung am Laufen zu halten. Damit droht der Johnson ein Versprechen zu brechen, mit dem er vor allem den rechten Flügel seiner Partei beschwichtigen wollte. Ein derartiges Manöver hätte voraussichtlich eine hitzige Ideologiedebatte über die Rolle der Republikaner bei Ausgabenkürzungen zur Folge, wodurch es zu einem teilweisen Shutdown der Regierung oder zur Absetzung von Johnson kommen könnte.", "original_target": "Angesichts der Tatsache, dass dieser Termin nur noch neun Tage entfernt ist, hat der Anführer der Republikaner im Senat, Mitch McConnell, angekündigt, dass der Kongress eine „Continuing Resolution“ verabschieden muss, um die Regierung am Laufen zu halten. Damit droht der Sprecher ein Versprechen zu brechen, mit dem er vor allem den rechten Flügel seiner Partei beschwichtigen wollte. Ein derartiges Manöver hätte voraussichtlich eine hitzige Ideologiedebatte über die Rolle der GOP bei Ausgabenkürzungen zur Folge, wodurch es zu einem teilweisen Stillstand der Regierung oder zur Absetzung von Johnson kommen könnte.", "difficulty_score": -0.10066480189561844}
{"lp": "en-es", "domain": "news", "document_id": "test-en-news_scotsman.87519", "segment_id": 114, "is_bad_source": false, "source": "As has been pointed out for years by, among others, The Scotsman, the wrongful conviction of hundreds of Post Office branch managers in the Horizon scandal is one of the most serious miscarriages of justice in history. People were sent to prison, lost homes, marriages and reputations, and endured the mental torment of an honest person treated as a criminal.", "target": "Como fue señalado durante años por, entre otros, The Scotsman, la condena injusta de cientos de directores de sucursales postales en el escándalo Horizon es uno de los mayores fracasos de la justicia en la historia. Se enviaron personas a la cárcel, se destruyeron matrimonios y reputaciones, se perdieron hogares y muchos vivieron el suplicio solo conoce un inocente tratado como un criminal.", "original_target": "Como se ha señalado durante años por, entre otros, The Scotsman, la condena injusta de cientos de directores de sucursal de oficinas de correos en el escándalo Horizon es uno de los mayores fracasos de la justicia de la historia. Personas encarceladas, destrucción de hogares, matrimonios y reputaciones así como el suplicio sufrido por una persona honrada tratada como un criminal.", "difficulty_score": 0.08103300631046295}
{"lp": "en-zh", "domain": "social", "document_id": "test-en-social_112122127346453600", "segment_id": 461, "is_bad_source": false, "source": "But no, I stand by it. Most natural speech is broken up, especially when people get emotional.", "target": "但我还是要坚持这一点。大多数自然语言都是不连贯的，尤其是当人们情绪激动的时候。", "original_target": "不，我坚持这一点。大多数自然语言都是断断续续的，尤其是说话者情绪激动时。", "difficulty_score": 0.2664526700973511}
{"lp": "en-nl", "domain": "social", "document_id": "test-en-social_112270350852000848", "segment_id": 630, "is_bad_source": false, "source": "We always start with a rough pencil sketch…", "target": "We beginnen altijd met een ruwe potloodschets…", "original_target": "We beginnen altijd met een ruwe potloodschets…", "difficulty_score": 0.4672069549560547}
{"lp": "en-de", "domain": "social", "document_id": "test-en-social_112166537145572640", "segment_id": 576, "is_bad_source": false, "source": "“get simple, semantic classes simply by using these two libraries and a build tool”", "target": "„erhalte einfache semantische Klassen, indem du einfach diese beiden Bibliotheken und ein Build-Tool verwendest“", "original_target": "„erhalte einfache semantische Klassen, indem du einfach diese beiden Bibliotheken und ein Build-Tool verwendest“", "difficulty_score": 0.43065619468688965}
{"lp": "en-es", "domain": "news", "document_id": "test-en-news_economist.14223", "segment_id": 25, "is_bad_source": false, "source": "Thomas Puls of IW Köln fears that the strikes will harm the image of Germany as a place for business. Local bosses are already fretting about a German version of the gilets jaunes protests in France in 2018, which culminated in yellow-jacketed demonstrators torching cars on the Champs-Elysées and the police stepping in with tear gas. Jochen Kopelke, head of Germany's police union, warned in an interview with Tagesspiegel, a daily, that the farmers were probably \"just the start of an enormous wave of protest this year.\" Germany was the only big economy to shrink in 2023, and the year ended on an especially sour note, with an unexpected drop in business confidence in December. This year is shaping up to be even tougher.", "target": "Thomas Puls, de IW Köln, teme que las huelgas perjudiquen la imagen de Alemania como enclave de negocios. Los empresarios locales ya están preocupados por una versión alemana de las protestas de los chalecos amarillos franceses en 2018, que culminaron con manifestantes ataviados de esa manera prendiendo fuego a autos en los Campos Elíseos y la policía interviniendo con gases lacrimógenos. Jochen Kopelke, jefe del sindicato de policías de Alemania, advirtió en una entrevista con el diario Tagesspiegel que los agricultores eran probablemente “tan solo el comienzo de una enorme ola de protestas este año”. Alemania fue la única gran economía que se contrajo en 2023 y el año terminó con una nota especialmente agria, con una caída inesperada de la confianza empresarial en diciembre. Este año se perfila aún más complicado.", "original_target": "Thomas Puls, de IW Köln, teme que las huelgas perjudiquen la imagen de Alemania como enclave de negocios. Los empresarios locales ya están preocupados por una versión alemana de las protestas de los chalecos amarillos franceses en 2018, que culminaron con manifestantes ataviados de esa manera prendiendo fuego a autos en los Campos Elíseos y la policía interviniendo con gases lacrimógenos. Jochen Kopelke, jefe del sindicato de policías de Alemania, advirtió en una entrevista con el diario Tagesspiegel que los agricultores eran probablemente \"tan sólo el comienzo de una enorme ola de protestas este año.\" Alemania fue la única gran economía que se contrajo en 2023 y el año terminó con una nota especialmente agria, con una caída inesperada de la confianza empresarial en diciembre. Este año se perfila aún más complicado.", "difficulty_score": -0.3332027792930603}
{"lp": "en-zh", "domain": "speech", "document_id": "test-en-speech_33gJqN796Eo_000", "segment_id": 705, "is_bad_source": false, "source": "Well, it still sounds better than Pink Floyd. So in Manic Miner, you collect all the items on the screen and head to the goal. And you gotta do it before you run out of air or hit something. Hit what exactly? Weeds! You can die from touching grass. It sounds like half my fanbase. And did you notice I died from touching a weed that was on a completely different platform? I just went through the platform and then hit the weed. That's good game design, man. And then there's this asshole over here who's going rrrrr!", "target": "好吧，听起来确实比平克·弗洛伊德强。《疯狂矿工》的游戏规则是收集屏幕上的所有物品，然后前往终点。你必须在氧气耗尽或碰到东西之前完成。到底是什么东西呢？杂草！你碰到杂草就会死。听起来像我的一半粉丝群。你有没有注意到，我是因为碰到一个完全不同平台上的杂草而死的？我直接穿过了平台，然后撞上了杂草。这游戏设计得真好。然后这边还有个讨厌鬼在啊啊啊地叫！", "original_target": "听起来还是比Pink Floyd强。在《疯狂矿工》中，你收集屏幕上的所有物品，然后直奔目标。而且得在用完氧气或碰到东西之前。到底是碰到什么呢？野草！你可能会因为碰到野草而挂掉。听起来像是我的半个粉丝团。你有没有注意到，我是因为碰了一根长在完全不同平台上的杂草挂掉的？我刚好穿过平台，就碰到了野草。嘿，这个游戏设计不错。然后呢，这边还有个混蛋在叫！", "difficulty_score": -2.841447114944458}
{"lp": "en-nl", "domain": "news", "document_id": "test-en-news_beverly_press.3585", "segment_id": 5, "is_bad_source": false, "source": "The Tierra del Sol Gallery is located at 7414 Santa Monica Blvd. For information, visit tierradelsolgallery.org.", "target": "Galerie Tierra del Sol is te vinden op Santa Monica Boulevard 7414. Ga naar tierradelsolgallery.org voor meer informatie.", "original_target": "De galerie Tierra del Sol is gevestigd op Santa Monica Boulevard 7414. Ga naar tierradelsolgallery.org voor meer informatie.", "difficulty_score": 0.4086627960205078}
{"lp": "en-de", "domain": "literary", "document_id": "test-en-literary_forever_snow_chunk_1_words_993", "segment_id": 884, "is_bad_source": false, "source": "“Why are they doing this to her?”", "target": "„Warum tut man ihr das an?“", "original_target": "„Warum tut man ihr das an?“", "difficulty_score": 0.5199424624443054}
{"lp": "en-es", "domain": "speech", "document_id": "test-en-speech_OPV8Gf1FFn8_021", "segment_id": 759, "is_bad_source": false, "source": "Mom says you don't want to visit us. She says that? Yeah. Everybody's got a story, son. I guess that's hers. Life's funny that way, you know?", "target": "Mamá dice que no quieres visitarnos. ¿Eso dice? Sí. Todo el mundo tiene una historia, hijo. Supongo que ésa es la suya. La vida es así de curiosa, ¿sabes?", "original_target": "Mamá dice que no quieres visitarnos. ¿Eso dice? Si. Todo el mundo tiene una historia, hijo. Supongo que ésa es la suya. La vida es así de curiosa, ¿sabes?", "difficulty_score": 0.2372959405183792}
{"lp": "en-zh", "domain": "social", "document_id": "test-en-social_112226149509052560", "segment_id": 608, "is_bad_source": false, "source": "Final edit: that level turned out to be a tool assisted upload, which no one thought was possible at the time but apparently it was! But people still persisted and it got beat in the end! https://fgc.network/objects/0f1b42c6-cbb1-49bb-91f5-db81bc71ea14", "target": "最终编辑：原来这个关卡上传的时候是用辅助工具通关的，当时没人觉得这可能实现，但显然确实可以！不过玩家们还是坚持不懈，最终成功通关！https://fgc.network/objects/0f1b42c6-cbb1-49bb-91f5-db81bc71ea14", "original_target": "最终编辑：这一关通过辅助工具通关了，当时没有人认为这是可能的，但显然有可能！但玩家们坚持不懈，最终挑战成功！https://fgc.network/objects/0f1b42c6-cbb1-49bb-91f5-db81bc71ea14", "difficulty_score": -0.7442566752433777}
{"lp": "en-nl", "domain": "literary", "document_id": "test-en-literary_forever_snow_chunk_2_words_986", "segment_id": 927, "is_bad_source": false, "source": "“Well I didn’t.” Ivory found the art supplies on their list and put it in a crate that they found. “And I’m not a girl.”", "target": "\"Nou, ik niet.\" Ivory vond de schildersbenodigdheden die op het lijstje stonden en stopte ze in een krat dat ergens stond. \"En ik ben geen meisje.\"", "original_target": "\"Nou, ik niet.\" Ivory vond de schildersbenodigdheden die op het lijstje stond en stopte die in een krat dat ergens stond. \"En ik ben geen meisje.\"", "difficulty_score": 0.06535331904888153}
{"lp": "en-de", "domain": "social", "document_id": "test-en-social_111977766001055104", "segment_id": 226, "is_bad_source": false, "source": "Moon landing time (about an hour to go) https://plus.nasa.gov/scheduled-video/intuitive-machines-1-lunar-landing/", "target": "Es ist Zeit für die Mondlandung (noch etwa eine Stunde) https://plus.nasa.gov/scheduled-video/intuitive-machines-1-lunar-landing/", "original_target": "Es ist Zeit für die Mondlandung (noch etwa eine Stunde) https://plus.nasa.gov/scheduled-video/intuitive-machines-1-lunar-landing/", "difficulty_score": 0.1451055109500885}
{"lp": "en-es", "domain": "social", "document_id": "test-en-social_112109186993725712", "segment_id": 281, "is_bad_source": false, "source": "This is the state of my upstairs bathroom right now.", "target": "Este es el estado actual de mi cuarto de baño de la planta alta.", "original_target": "Este es el estado de mi cuarto de baño en la planta de arriba en estos momentos.", "difficulty_score": 0.4389936923980713}
{"lp": "en-zh", "domain": "social", "document_id": "test-en-social_112140958167999904", "segment_id": 481, "is_bad_source": false, "source": "It's my first ever crown dentist visit: Prep today, then fitting in a fortnight. I'm practising opening my mouth wide.", "target": "这可是我人生第一次去牙医那儿做牙冠：今天是牙体预备，两周后试戴。我正在练习张大嘴巴。", "original_target": "这是我第一次去牙医那做牙冠：今天是牙体预备，两周后试戴。我在练习张大嘴巴。", "difficulty_score": -0.23201410472393036}
{"lp": "en-nl", "domain": "news", "document_id": "test-en-news_scotsman.87445", "segment_id": 81, "is_bad_source": false, "source": "If anyone dares to say that Scotland's NHS is not in a state of crisis or that these are just the usual winter problems, we should be outraged. The danger is that politicians like the embattled Health Secretary, Michael Matheson, will succeed in their efforts to convince us that, while regrettable, this is somehow acceptable, that there is nothing more that ministers can do in the circumstances, that this is the new normal.", "target": "Mocht er iemand zijn die durft te beweren dat de NHS in Schotland zich niet in een crisis bevindt of dat dit de normale winterperikelen zijn, dan zouden we hier woedend over moeten zijn. Het gevaar bestaat dat politici, zoals de omstreden minister voor Gezondheid Michael Matheson, ons kunnen overtuigen van het feit dat we dit maar moeten accepteren, dat ministers onder deze omstandigheden niets meer kunnen doen en dat dit het nieuwe normaal is. Hoe betreurenswaardig dan ook.", "original_target": "Mocht er iemand zijn die durft te beweren dat de NHS in Schotland zich niet in een crisis bevindt of dat dit de gewone winterproblemen zijn dan zouden we verbijsterd zijn. Het gevaar bestaat dat politici, zoals de omstreden gezondheidsminister Michael Matheson, in hun inspanningen zullen slagen om ons ervan te overtuigen dat dit, hoewel betreurenswaardig, op de een of andere manier acceptabel is, dat ministers onder deze omstandigheden niets meer kunnen doen, dat dit het nieuwe normaal is.", "difficulty_score": 0.15169908106327057}
{"lp": "en-de", "domain": "speech", "document_id": "test-en-speech_OPV8Gf1FFn8_021", "segment_id": 759, "is_bad_source": false, "source": "Mom says you don't want to visit us. She says that? Yeah. Everybody's got a story, son. I guess that's hers. Life's funny that way, you know?", "target": "Mom sagt, du willst uns nicht besuchen. Das sagt sie? Ja. Jeder hat seine Geschichte, Junge. Das ist wohl ihre. Das Leben ist schon komisch, weißt du?", "original_target": "Mama sagt, du willst uns nicht besuchen. Das sagt sie? Ja. Jeder hat so seine Geschichte, Junge. Das ist wohl ihre. Das Leben ist schon komisch, was?", "difficulty_score": 0.2372959405183792}
