{"lp": "en-es", "domain": "social", "document_id": "test-en-social_112289379466442912", "segment_id": 654, "is_bad_source": false, "source": "Does this make sense? Would this be useful?", "target": "¿Tiene sentido? ¿Sería útil?", "original_target": "¿Tiene sentido? ¿Sería útil?", "difficulty_score": 0.5294290781021118}
{"lp": "en-de", "domain": "social", "document_id": "test-en-social_112112980319428992", "segment_id": 418, "is_bad_source": false, "source": "I’m splurging on a new set of frames, these red ones I reeeeally like.", "target": "Ich gönn mir ein neues Gestell, dieses rote, das gefällt mir wirklich.", "original_target": "Ich gönne mir ein neues Gestell, dieses rote, das mir wirklich gefällt.", "difficulty_score": 0.15051892399787903}
{"lp": "en-nl", "domain": "social", "document_id": "test-en-social_112122127346453600", "segment_id": 459, "is_bad_source": false, "source": "Chapter five is a long one, but so fucking angsty. Yisssss, the good shit.", "target": "Hoofdstuk vijf wordt lang, maar echt vreselijk eng. Yes! Bizar goed.", "original_target": "Hoofstuk vijf wordt een lange, maar echt aangrijpend. Yes, het goede spul.", "difficulty_score": 0.13773342967033386}
{"lp": "en-zh", "domain": "news", "document_id": "test-en-news_newsweek.63908", "segment_id": 46, "is_bad_source": false, "source": "However, with that deadline just 9 days away, Senate Republican Leader Mitch McConnell has said Congress will need to pass a CR to keep things open, meaning the speaker may soon break a promise he made, largely to appease his right flank. Such a maneuver could ignite a heated ideological battle in a closely divided House over the GOP's role in spending cuts that may see the government face a partial shutdown or Johnson removed from his job.", "target": "然而，随着截止期限仅剩九天，参议院共和党领袖米奇·麦康奈尔表示，国会需要通过一项持续决议案以维持政府继续运作，这意味着众议院议长可能很快就会为了安抚右翼阵营而违反他所做的承诺。这种举动可能会在本就分歧严重的众议院中引发一场激烈的意识形态斗争，围绕共和党在削减开支方面的角色展开辩论，这可能导致政府面临部分关闭或约翰逊被免职。", "original_target": "但在距离截止期限只有九天之际，参议院共和党领袖米奇·麦康奈尔表示，国会需要通过一项持续决议案，来维持政府继续运作，这意味着众议院议长为了安抚右翼阵营，可能很快就会违背他做出的承诺。此策略可能会在原本分歧严重的众议院引发一场激烈的意识形态之争，争论的焦点是共和党在削减开支方面所扮演的角色，这可能会导致政府面临部分关门或约翰逊被免职。", "difficulty_score": -0.10066480189561844}
{"lp": "en-es", "domain": "news", "document_id": "test-en-news_scotsman.87519", "segment_id": 114, "is_bad_source": false, "source": "As has been pointed out for years by, among others, The Scotsman, the wrongful conviction of hundreds of Post Office branch managers in the Horizon scandal is one of the most serious miscarriages of justice in history. People were sent to prison, lost homes, marriages and reputations, and endured the mental torment of an honest person treated as a criminal.", "target": "Como fue señalado durante años por, entre otros, The Scotsman, la condena injusta de cientos de directores de sucursales postales en el escándalo Horizon es uno de los mayores fracasos de la justicia en la historia. Se enviaron personas a la cárcel, se destruyeron matrimonios y reputaciones, se perdieron hogares y muchos vivieron el suplicio solo conoce un inocente tratado como un criminal.", "original_target": "Como se ha señalado durante años por, entre otros, The Scotsman, la condena injusta de cientos de directores de sucursal de oficinas de correos en el escándalo Horizon es uno de los mayores fracasos de la justicia de la historia. Personas encarceladas, destrucción de hogares, matrimonios y reputaciones así como el suplicio sufrido por una persona honrada tratada como un criminal.", "difficulty_score": 0.08103300631046295}
{"lp": "en-de", "domain": "social", "document_id": "test-en-social_112122127346453600", "segment_id": 461, "is_bad_source": false, "source": "But no, I stand by it. Most natural speech is broken up, especially when people get emotional.", "target": "Aber nein, ich bleibe dabei. Natürliche Sprache ist meistens abgehackt, besonders wenn man emotional wird.", "original_target": "Aber nein, ich bleibe dabei. Natürliche Sprache ist meistens nicht flüssig, besonders wenn jemand emotional wird.", "difficulty_score": 0.2664526700973511}
{"lp": "en-nl", "domain": "social", "document_id": "test-en-social_112270350852000848", "segment_id": 630, "is_bad_source": false, "source": "We always start with a rough pencil sketch…", "target": "We beginnen altijd met een ruwe potloodschets…", "original_target": "We beginnen altijd met een ruwe potloodschets…", "difficulty_score": 0.4672069549560547}
{"lp": "en-zh", "domain": "social", "document_id": "test-en-social_112166537145572640", "segment_id": 576, "is_bad_source": false, "source": "“get simple, semantic classes simply by using these two libraries and a build tool”", "target": "“只需使用这两个库和构建工具，即可获得简单的语义类”", "original_target": "“只需使用这两个组件库和构建工具就能获得简单的语义类”", "difficulty_score": 0.43065619468688965}
{"lp": "en-es", "domain": "news", "document_id": "test-en-news_economist.14223", "segment_id": 25, "is_bad_source": false, "source": "Thomas Puls of IW Köln fears that the strikes will harm the image of Germany as a place for business. Local bosses are already fretting about a German version of the gilets jaunes protests in France in 2018, which culminated in yellow-jacketed demonstrators torching cars on the Champs-Elysées and the police stepping in with tear gas. Jochen Kopelke, head of Germany's police union, warned in an interview with Tagesspiegel, a daily, that the farmers were probably \"just the start of an enormous wave of protest this year.\" Germany was the only big economy to shrink in 2023, and the year ended on an especially sour note, with an unexpected drop in business confidence in December. This year is shaping up to be even tougher.", "target": "Thomas Puls, de IW Köln, teme que las huelgas perjudiquen la imagen de Alemania como enclave de negocios. Los empresarios locales ya están preocupados por una versión alemana de las protestas de los chalecos amarillos franceses en 2018, que culminaron con manifestantes ataviados de esa manera prendiendo fuego a autos en los Campos Elíseos y la policía interviniendo con gases lacrimógenos. Jochen Kopelke, jefe del sindicato de policías de Alemania, advirtió en una entrevista con el diario Tagesspiegel que los agricultores eran probablemente “tan solo el comienzo de una enorme ola de protestas este año”. Alemania fue la única gran economía que se contrajo en 2023 y el año terminó con una nota especialmente agria, con una caída inesperada de la confianza empresarial en diciembre. Este año se perfila aún más complicado.", "original_target": "Thomas Puls, de IW Köln, teme que las huelgas perjudiquen la imagen de Alemania como enclave de negocios. Los empresarios locales ya están preocupados por una versión alemana de las protestas de los chalecos amarillos franceses en 2018, que culminaron con manifestantes ataviados de esa manera prendiendo fuego a autos en los Campos Elíseos y la policía interviniendo con gases lacrimógenos. Jochen Kopelke, jefe del sindicato de policías de Alemania, advirtió en una entrevista con el diario Tagesspiegel que los agricultores eran probablemente \"tan sólo el comienzo de una enorme ola de protestas este año.\" Alemania fue la única gran economía que se contrajo en 2023 y el año terminó con una nota especialmente agria, con una caída inesperada de la confianza empresarial en diciembre. Este año se perfila aún más complicado.", "difficulty_score": -0.3332027792930603}
{"lp": "en-de", "domain": "speech", "document_id": "test-en-speech_33gJqN796Eo_000", "segment_id": 705, "is_bad_source": false, "source": "Well, it still sounds better than Pink Floyd. So in Manic Miner, you collect all the items on the screen and head to the goal. And you gotta do it before you run out of air or hit something. Hit what exactly? Weeds! You can die from touching grass. It sounds like half my fanbase. And did you notice I died from touching a weed that was on a completely different platform? I just went through the platform and then hit the weed. That's good game design, man. And then there's this asshole over here who's going rrrrr!", "target": "Naja, es klingt immer noch besser als Pink Floyd. In Manic Miner kannst du also alle Gegenstände auf dem Bildschirm sammeln und zum Ziel gehen. Und das tust du besser, bevor dir die Luft ausgeht oder ein Hindernis berührst. Und was genau? Unkraut! Du kannst sterben, wenn du Gras berührst. Das klingt nach der Hälfte meiner Fans. Und habt ihr gesehen, dass ich gestorben bin, weil ich Unkraut berührt hab, das auf einer ganz anderen Plattform war? Ich bin einfach durch die Plattform durch und hab das Unkraut berührt. Das ist tolles Spieldesign. Und dann ist dort drüben dieses Arschloch, das rrrrr macht!", "original_target": "Naja, es klingt immer noch besser als Pink Floyd. In Manic Miner kannst du also alle Artikel auf dem Bildschirm sammeln und zum Ziel gehen. Und das tust du besser, bevor dir die Luft ausgeht oder du auf ein Hindernis stößt. Auf was genau? Unkraut! Du kannst sterben, wenn du Gras berührst. Das klingt nach der Hälfte meiner Fans. Und hast du gemerkt, dass ich durch die Berührung eines Unkrauts starb, das sich auf einer ganz anderen Plattform befand? Ich ging einfach durch die Plattform und traf auf das Unkraut. Das ist tolles Spieldesign, Mensch. Und dann ist dort drüben dieses Arschloch, das rrrrr macht!", "difficulty_score": -2.841447114944458}
{"lp": "en-nl", "domain": "news", "document_id": "test-en-news_beverly_press.3585", "segment_id": 5, "is_bad_source": false, "source": "The Tierra del Sol Gallery is located at 7414 Santa Monica Blvd. For information, visit tierradelsolgallery.org.", "target": "Galerie Tierra del Sol is te vinden op Santa Monica Boulevard 7414. Ga naar tierradelsolgallery.org voor meer informatie.", "original_target": "De galerie Tierra del Sol is gevestigd op Santa Monica Boulevard 7414. Ga naar tierradelsolgallery.org voor meer informatie.", "difficulty_score": 0.4086627960205078}
{"lp": "en-zh", "domain": "literary", "document_id": "test-en-literary_forever_snow_chunk_1_words_993", "segment_id": 884, "is_bad_source": false, "source": "“Why are they doing this to her?”", "target": "“他们为什么要这样对她？”", "original_target": "“他们为什么要这样对她？”", "difficulty_score": 0.5199424624443054}
{"lp": "en-es", "domain": "speech", "document_id": "test-en-speech_OPV8Gf1FFn8_021", "segment_id": 759, "is_bad_source": false, "source": "Mom says you don't want to visit us. She says that? Yeah. Everybody's got a story, son. I guess that's hers. Life's funny that way, you know?", "target": "Mamá dice que no quieres visitarnos. ¿Eso dice? Sí. Todo el mundo tiene una historia, hijo. Supongo que ésa es la suya. La vida es así de curiosa, ¿sabes?", "original_target": "Mamá dice que no quieres visitarnos. ¿Eso dice? Si. Todo el mundo tiene una historia, hijo. Supongo que ésa es la suya. La vida es así de curiosa, ¿sabes?", "difficulty_score": 0.2372959405183792}
{"lp": "en-de", "domain": "social", "document_id": "test-en-social_112226149509052560", "segment_id": 608, "is_bad_source": false, "source": "Final edit: that level turned out to be a tool assisted upload, which no one thought was possible at the time but apparently it was! But people still persisted and it got beat in the end! https://fgc.network/objects/0f1b42c6-cbb1-49bb-91f5-db81bc71ea14", "target": "Letzter Nachtrag: Es hat sich rausgestellt, dass dieses Level mit Tool-Unterstützung hochgeladen wurde, was damals niemand für möglich hielt, aber offensichtlich ging es. Aber die Spieler ließen nicht locker, und am Ende hat es jemand geschafft! https://fgc.network/objects/0f1b42c6-cbb1-49bb-91f5-db81bc71ea14", "original_target": "Letzter Nachtrag: Es hat sich herausgestellt, dass dieses Level mit Tool-Unterstützung hochgeladen wurde, was damals niemand für möglich hielt, aber offensichtlich war es so. Aber die Spieler ließen nicht locker, und am Ende hat es jemand geschafft! https://fgc.network/objects/0f1b42c6-cbb1-49bb-91f5-db81bc71ea14", "difficulty_score": -0.7442566752433777}
{"lp": "en-nl", "domain": "literary", "document_id": "test-en-literary_forever_snow_chunk_2_words_986", "segment_id": 927, "is_bad_source": false, "source": "“Well I didn’t.” Ivory found the art supplies on their list and put it in a crate that they found. “And I’m not a girl.”", "target": "\"Nou, ik niet.\" Ivory vond de schildersbenodigdheden die op het lijstje stonden en stopte ze in een krat dat ergens stond. \"En ik ben geen meisje.\"", "original_target": "\"Nou, ik niet.\" Ivory vond de schildersbenodigdheden die op het lijstje stond en stopte die in een krat dat ergens stond. \"En ik ben geen meisje.\"", "difficulty_score": 0.06535331904888153}
{"lp": "en-zh", "domain": "social", "document_id": "test-en-social_111977766001055104", "segment_id": 226, "is_bad_source": false, "source": "Moon landing time (about an hour to go) https://plus.nasa.gov/scheduled-video/intuitive-machines-1-lunar-landing/", "target": "登月时间（还有大约1小时）https://plus.nasa.gov/scheduled-video/intuitive-machines-1-lunar-landing/", "original_target": "登月时间（倒计时约1小时）https://plus.nasa.gov/scheduled-video/intuitive-machines-1-lunar-landing/", "difficulty_score": 0.1451055109500885}
{"lp": "en-es", "domain": "social", "document_id": "test-en-social_112109186993725712", "segment_id": 281, "is_bad_source": false, "source": "This is the state of my upstairs bathroom right now.", "target": "Este es el estado actual de mi cuarto de baño de la planta alta.", "original_target": "Este es el estado de mi cuarto de baño en la planta de arriba en estos momentos.", "difficulty_score": 0.4389936923980713}
{"lp": "en-de", "domain": "social", "document_id": "test-en-social_112140958167999904", "segment_id": 481, "is_bad_source": false, "source": "It's my first ever crown dentist visit: Prep today, then fitting in a fortnight. I'm practising opening my mouth wide.", "target": "Das ist mein allererster Zahnarztbesuch wegen einer Krone: Heute war die Vorbereitung. In zwei Wochen ist dann die Anpassung. Ich übe schon mal, meinen Mund weit aufzumachen.", "original_target": "Das ist mein allererster Zahnarztbesuch wegen einer Krone: Heute war die Vorbereitung. In zwei Wochen ist dann die Anpassung. Ich übe schon mal, meinen Mund weit aufzumachen.", "difficulty_score": -0.23201410472393036}
{"lp": "en-nl", "domain": "news", "document_id": "test-en-news_scotsman.87445", "segment_id": 81, "is_bad_source": false, "source": "If anyone dares to say that Scotland's NHS is not in a state of crisis or that these are just the usual winter problems, we should be outraged. The danger is that politicians like the embattled Health Secretary, Michael Matheson, will succeed in their efforts to convince us that, while regrettable, this is somehow acceptable, that there is nothing more that ministers can do in the circumstances, that this is the new normal.", "target": "Mocht er iemand zijn die durft te beweren dat de NHS in Schotland zich niet in een crisis bevindt of dat dit de normale winterperikelen zijn, dan zouden we hier woedend over moeten zijn. Het gevaar bestaat dat politici, zoals de omstreden minister voor Gezondheid Michael Matheson, ons kunnen overtuigen van het feit dat we dit maar moeten accepteren, dat ministers onder deze omstandigheden niets meer kunnen doen en dat dit het nieuwe normaal is. Hoe betreurenswaardig dan ook.", "original_target": "Mocht er iemand zijn die durft te beweren dat de NHS in Schotland zich niet in een crisis bevindt of dat dit de gewone winterproblemen zijn dan zouden we verbijsterd zijn. Het gevaar bestaat dat politici, zoals de omstreden gezondheidsminister Michael Matheson, in hun inspanningen zullen slagen om ons ervan te overtuigen dat dit, hoewel betreurenswaardig, op de een of andere manier acceptabel is, dat ministers onder deze omstandigheden niets meer kunnen doen, dat dit het nieuwe normaal is.", "difficulty_score": 0.15169908106327057}
{"lp": "en-zh", "domain": "speech", "document_id": "test-en-speech_OPV8Gf1FFn8_021", "segment_id": 759, "is_bad_source": false, "source": "Mom says you don't want to visit us. She says that? Yeah. Everybody's got a story, son. I guess that's hers. Life's funny that way, you know?", "target": "妈妈说你不想来看我们？她真是这么说的？没错。每个人都有自己的故事，孩子。我想这就是她的故事吧。生活有时候就是这么搞笑，你知道吗？", "original_target": "妈妈说你不想来看我们。 她这么说的？ 对。 每个人都有自己的故事，孩子。我想那是她的故事。生活就是这么有意思，你知道吧？", "difficulty_score": 0.2372959405183792}
