{"lp": "en-nl", "domain": "social", "document_id": "test-en-social_112289379466442912", "segment_id": 654, "is_bad_source": false, "source": "Does this make sense? Would this be useful?", "target": "Slaat dat ergens op? Zou dat nuttig zijn?", "original_target": "Slaat dat ergens op? Zou dat nuttig zijn?", "difficulty_score": 0.5294290781021118}
{"lp": "en-es", "domain": "social", "document_id": "test-en-social_112112980319428992", "segment_id": 418, "is_bad_source": false, "source": "I’m splurging on a new set of frames, these red ones I reeeeally like.", "target": "Voy a gastar en unos armazones nuevos; estos rojos me gustan muuucho.", "original_target": "Me voy a dar un capricho en unas monturas nuevas; estas rojas me gustan muuucho.", "difficulty_score": 0.15051892399787903}
{"lp": "en-de", "domain": "social", "document_id": "test-en-social_112122127346453600", "segment_id": 459, "is_bad_source": false, "source": "Chapter five is a long one, but so fucking angsty. Yisssss, the good shit.", "target": "Kapitel fünf ist lang, aber so verdammt furchterregend. Oh ja, das ist der gute Shit!", "original_target": "Kapitel fünf ist lang, aber so verdammt furchterregend. Ach, wie schön.", "difficulty_score": 0.13773342967033386}
{"lp": "en-zh", "domain": "news", "document_id": "test-en-news_newsweek.63908", "segment_id": 46, "is_bad_source": false, "source": "However, with that deadline just 9 days away, Senate Republican Leader Mitch McConnell has said Congress will need to pass a CR to keep things open, meaning the speaker may soon break a promise he made, largely to appease his right flank. Such a maneuver could ignite a heated ideological battle in a closely divided House over the GOP's role in spending cuts that may see the government face a partial shutdown or Johnson removed from his job.", "target": "然而，随着截止期限仅剩九天，参议院共和党领袖米奇·麦康奈尔表示，国会需要通过一项持续决议案以维持政府继续运作，这意味着众议院议长可能很快就会为了安抚右翼阵营而违反他所做的承诺。这种举动可能会在本就分歧严重的众议院中引发一场激烈的意识形态斗争，围绕共和党在削减开支方面的角色展开辩论，这可能导致政府面临部分关闭或约翰逊被免职。", "original_target": "但在距离截止期限只有九天之际，参议院共和党领袖米奇·麦康奈尔表示，国会需要通过一项持续决议案，来维持政府继续运作，这意味着众议院议长为了安抚右翼阵营，可能很快就会违背他做出的承诺。此策略可能会在原本分歧严重的众议院引发一场激烈的意识形态之争，争论的焦点是共和党在削减开支方面所扮演的角色，这可能会导致政府面临部分关门或约翰逊被免职。", "difficulty_score": -0.10066480189561844}
{"lp": "en-nl", "domain": "news", "document_id": "test-en-news_scotsman.87519", "segment_id": 114, "is_bad_source": false, "source": "As has been pointed out for years by, among others, The Scotsman, the wrongful conviction of hundreds of Post Office branch managers in the Horizon scandal is one of the most serious miscarriages of justice in history. People were sent to prison, lost homes, marriages and reputations, and endured the mental torment of an honest person treated as a criminal.", "target": "Zoals onder andere The Scotsman al jarenlang zegt, is de onrechtmatige veroordeling van honderden filiaalmanagers van Britse postkantoren in het Horizon-schandaal een van de ernstigste gerechtelijke dwalingen uit de geschiedenis. Mensen kregen gevangenisstraffen, verloren hun huis en reputatie en huwelijken strandden. Eerlijke mensen raakten mentaal getormenteerd omdat ze als crimineel behandeld werden.", "original_target": "Zoals al jaren geroepen wordt door, onder anderen, The Scotsman, is de onrechtmatige veroordeling van honderden filiaalmanagers van Britse postkantoren in het Horizon-schandaal een van de ernstigste dwalingen van het gerecht in de geschiedenis. Mensen zijn naar de gevangenis gestuurd, raakten hun woning, huwelijk en reputatie kwijt, en moesten als eerlijk mens de geestelijke kwelling zien te doorstaan om als een crimineel behandeld te worden.", "difficulty_score": 0.08103300631046295}
{"lp": "en-es", "domain": "social", "document_id": "test-en-social_112122127346453600", "segment_id": 461, "is_bad_source": false, "source": "But no, I stand by it. Most natural speech is broken up, especially when people get emotional.", "target": "Pero no, lo defiendo. La mayor parte del habla natural es entrecortada, sobre todo cuando la gente se emociona.", "original_target": "Pero no, lo defiendo. La mayor parte del habla natural es entrecortada, sobre todo cuando la gente se emociona.", "difficulty_score": 0.2664526700973511}
{"lp": "en-de", "domain": "social", "document_id": "test-en-social_112270350852000848", "segment_id": 630, "is_bad_source": false, "source": "We always start with a rough pencil sketch…", "target": "Wir fangen immer mit einer groben Bleistiftskizze an…", "original_target": "Wir fangen immer mit einer groben Bleistiftskizze an...", "difficulty_score": 0.4672069549560547}
{"lp": "en-zh", "domain": "social", "document_id": "test-en-social_112166537145572640", "segment_id": 576, "is_bad_source": false, "source": "“get simple, semantic classes simply by using these two libraries and a build tool”", "target": "“只需使用这两个库和构建工具，即可获得简单的语义类”", "original_target": "“只需使用这两个组件库和构建工具就能获得简单的语义类”", "difficulty_score": 0.43065619468688965}
{"lp": "en-nl", "domain": "news", "document_id": "test-en-news_economist.14223", "segment_id": 25, "is_bad_source": false, "source": "Thomas Puls of IW Köln fears that the strikes will harm the image of Germany as a place for business. Local bosses are already fretting about a German version of the gilets jaunes protests in France in 2018, which culminated in yellow-jacketed demonstrators torching cars on the Champs-Elysées and the police stepping in with tear gas. Jochen Kopelke, head of Germany's police union, warned in an interview with Tagesspiegel, a daily, that the farmers were probably \"just the start of an enormous wave of protest this year.\" Germany was the only big economy to shrink in 2023, and the year ended on an especially sour note, with an unexpected drop in business confidence in December. This year is shaping up to be even tougher.", "target": "Thomas Puls van IW Köln is bang dat de stakingen het imago van Duitsland als ondernemingsland zullen schaden. Lokale werkgevers zijn nu al bang voor een mogelijke Duitse versie van de protesten in Frankrijk in 2018, waarbij demonstranten in gele hesjes auto's in brand staken op de Champs-Elysées en de politie moest ingrijpen met traangas. In een interview met het dagblad Tagespiegel waarschuwde Jochen Kopelke, voorzitter van de Duitse politievakbond, dat \"de boerenprotesten waarschijnlijk slechts de voorbode zijn van een enorme golf van protesten dit jaar\". In 2023 was Duitsland de enige grote economie die kromp en in december bleek zelfs dat het vertrouwen onder ondernemers onverwachts gedaald is. Dit jaar belooft daarom nog moeilijker te worden.", "original_target": "Thomas Puls van IW Köln is bang dat de stakingen het imago van Duitsland als zakenland zullen schaden. Lokale werkgevers zijn nu al bang voor een mogelijke Duitse versie van de protesten in Frankrijk in 2018, toen demonstranten in gele hesjes uiteindelijk auto's in brand staken op de Champs-Elysées en de politie moest ingrijpen met traangas. Jochen Kopelke, voorzitter van de Duitse politievakbond, waarschuwde in een interview met het dagblad Tagesspiegel dat de boeren \"waarschijnlijk slechts de voorbode waren van een enorme golf van protesten dit jaar\". Duitsland was de enige grote economie die in 2023 kromp en het jaar eindigde bijzonder zuur toen het vertrouwen onder ondernemers in december onverwachts daalde. Dit jaar belooft nog moeilijker te worden.", "difficulty_score": -0.3332027792930603}
{"lp": "en-es", "domain": "speech", "document_id": "test-en-speech_33gJqN796Eo_000", "segment_id": 705, "is_bad_source": false, "source": "Well, it still sounds better than Pink Floyd. So in Manic Miner, you collect all the items on the screen and head to the goal. And you gotta do it before you run out of air or hit something. Hit what exactly? Weeds! You can die from touching grass. It sounds like half my fanbase. And did you notice I died from touching a weed that was on a completely different platform? I just went through the platform and then hit the weed. That's good game design, man. And then there's this asshole over here who's going rrrrr!", "target": "Bueno, suena mejor que Pink Floyd y todo. En Manic Miner tienes que juntar todos los objetos en pantalla y llegar hasta la meta. Y tienes que hacerlo antes de quedarte sin aire o darle un golpe a algo. ¿Golpearte con qué exactamente? ¡Con las malas hierbas! Puedes morir por tocar pasto. Suena como la mitad de mis fans. ¿Y te diste cuenta de que morí por tocar una hierba mala que estaba en una plataforma totalmente diferente? Solamente atravesé la plataforma y luego toqué la hierba. Este sí que es un buen diseño de juego, amigo. Y luego está ese imbécil de ahí que hace ¡arrr!", "original_target": "Bueno, suena mejor que Pink Floyd y todo. En Manic Miner tienes que recoger todos los objetos en pantalla e ir hacia la meta. Y tienes que hacerlo antes de quedarte sin aire o darle un golpe a algo. ¿Golpearte con qué exactamente? ¡Con las malas hierbas! Puedes morir por tocar la hierba. Suena como la mitad de mis fans. ¿Y te diste cuenta de que morí por tocar una mala hierba que estaba en una plataforma totalmente diferente? Solamente pasé por la plataforma y luego toqué la hierba. Este sí que es un buen diseño de juego, amigo. Y luego está ese imbécil de ahí que hace ¡arrr!", "difficulty_score": -2.841447114944458}
{"lp": "en-de", "domain": "news", "document_id": "test-en-news_beverly_press.3585", "segment_id": 5, "is_bad_source": false, "source": "The Tierra del Sol Gallery is located at 7414 Santa Monica Blvd. For information, visit tierradelsolgallery.org.", "target": "Galerie „Tierra del Sol“, 7414 Santa Monica Blvd. Weitere Informationen finden Sie unter tierradelsolgallery.org.", "original_target": "Die Galerie „Tierra del Sol“ befindet sich in 7414 Santa Monica Blvd. Weitere Informationen finden Sie unter tierradelsolgallery.org.", "difficulty_score": 0.4086627960205078}
{"lp": "en-zh", "domain": "literary", "document_id": "test-en-literary_forever_snow_chunk_1_words_993", "segment_id": 884, "is_bad_source": false, "source": "“Why are they doing this to her?”", "target": "“他们为什么要这样对她？”", "original_target": "“他们为什么要这样对她？”", "difficulty_score": 0.5199424624443054}
{"lp": "en-nl", "domain": "speech", "document_id": "test-en-speech_OPV8Gf1FFn8_021", "segment_id": 759, "is_bad_source": false, "source": "Mom says you don't want to visit us. She says that? Yeah. Everybody's got a story, son. I guess that's hers. Life's funny that way, you know?", "target": "Mama zegt dat je ons niet wil bezoeken. Zegt ze dat? Ja. Er zit een verhaal achter iedereen, jongen. Blijkbaar is dat haar verhaal. Weet je, soms loopt het leven anders dan je denkt.", "original_target": "Mama zegt dat je ons niet wil bezoeken. Zegt ze dat? Ja. Iedereen heeft een verhaal te vertellen, zoon. Blijkbaar is dat haar verhaal. Soms pakt het leven gewoon grappig uit, weet je wel?", "difficulty_score": 0.2372959405183792}
{"lp": "en-es", "domain": "social", "document_id": "test-en-social_112226149509052560", "segment_id": 608, "is_bad_source": false, "source": "Final edit: that level turned out to be a tool assisted upload, which no one thought was possible at the time but apparently it was! But people still persisted and it got beat in the end! https://fgc.network/objects/0f1b42c6-cbb1-49bb-91f5-db81bc71ea14", "target": "Edición final: Resulta que ese nivel se subió con ayuda de una herramienta, algo que nadie pensaba que fuera posible en ese momento, ¡pero aparentemente sí lo era! Pero la gente perseveró y al final lo pasaron. https://fgc.network/objects/0f1b42c6-cbb1-49bb-91f5-db81bc71ea14", "original_target": "Edición final: Resulta que se subió el nivel con asistencia de herramientas, algo que nadie pensaba que fuera posible en ese momento, ¡pero aparentemente sí lo era! Pero la gente perseveró y al final se lo pasaron. https://fgc.network/objects/0f1b42c6-cbb1-49bb-91f5-db81bc71ea14", "difficulty_score": -0.7442566752433777}
{"lp": "en-de", "domain": "literary", "document_id": "test-en-literary_forever_snow_chunk_2_words_986", "segment_id": 927, "is_bad_source": false, "source": "“Well I didn’t.” Ivory found the art supplies on their list and put it in a crate that they found. “And I’m not a girl.”", "target": "„Ich aber nicht.“ Ivory fand die Malsachen auf der Liste und legte sie in eine Kiste. „Außerdem bin ich kein Mädchen.“", "original_target": "„Ich aber nicht.“ Ivory fand die Malsachen auf der Liste und legte sie in eine Kiste, die dort herumstand. „Außerdem bin ich kein Mädchen.“", "difficulty_score": 0.06535331904888153}
{"lp": "en-zh", "domain": "social", "document_id": "test-en-social_111977766001055104", "segment_id": 226, "is_bad_source": false, "source": "Moon landing time (about an hour to go) https://plus.nasa.gov/scheduled-video/intuitive-machines-1-lunar-landing/", "target": "登月时间（还有大约1小时）https://plus.nasa.gov/scheduled-video/intuitive-machines-1-lunar-landing/", "original_target": "登月时间（倒计时约1小时）https://plus.nasa.gov/scheduled-video/intuitive-machines-1-lunar-landing/", "difficulty_score": 0.1451055109500885}
{"lp": "en-nl", "domain": "social", "document_id": "test-en-social_112109186993725712", "segment_id": 281, "is_bad_source": false, "source": "This is the state of my upstairs bathroom right now.", "target": "Dit is hoe mijn badkamer boven er nu uitziet.", "original_target": "Dit is hoe mijn badkamer boven er nu uitziet.", "difficulty_score": 0.4389936923980713}
{"lp": "en-es", "domain": "social", "document_id": "test-en-social_112140958167999904", "segment_id": 481, "is_bad_source": false, "source": "It's my first ever crown dentist visit: Prep today, then fitting in a fortnight. I'm practising opening my mouth wide.", "target": "Es mi primera visita al dentista por una corona: Hoy toca preparación y en quince días es la colocación. Estoy practicando el abrir bien la boca.", "original_target": "Es mi primera visita al dentista por una corona: Hoy toca preparación y en quince días es la colocación. Estoy practicando el abrir bien la boca.", "difficulty_score": -0.23201410472393036}
{"lp": "en-de", "domain": "news", "document_id": "test-en-news_scotsman.87445", "segment_id": 81, "is_bad_source": false, "source": "If anyone dares to say that Scotland's NHS is not in a state of crisis or that these are just the usual winter problems, we should be outraged. The danger is that politicians like the embattled Health Secretary, Michael Matheson, will succeed in their efforts to convince us that, while regrettable, this is somehow acceptable, that there is nothing more that ministers can do in the circumstances, that this is the new normal.", "target": "Sollte irgendjemand behaupten, dass sich der schottische NHS nicht in einer Krise befindet oder es sich nur um die üblichen Wehwehchen im Winter handele, dann ist das ein Grund, sich aufzuregen. Wir laufen Gefahr, dass es Politikern – wie dem umstrittenen Gesundheitsminister Michael Matheson – gelingt, uns davon zu überzeugen, dass die Situation zwar bedauerlich, aber dennoch irgendwie akzeptabel sei. Und dass die Regierungsverantwortlichen unter den gegebenen Umständen keine weiteren Maßnahmen ergreifen können, dass dies die neue Normalität sei.", "original_target": "Falls jemand zu behaupten wagt, dass sich der schottische NHS nicht in einer Krise befindet oder es sich nur um die üblichen Winterprobleme handele, sollten wir uns entrüsten. Es besteht die Gefahr, dass es Politikern wie dem umstrittenen Gesundheitsminister Michael Matheson gelingt, uns davon zu überzeugen, dass die Situation zwar bedauerlich, aber doch irgendwie akzeptabel ist, dass die Regierungsverantwortlichen unter den gegebenen Umständen keine weiteren Maßnahmen ergreifen können und dass dies die neue Normalität sei.", "difficulty_score": 0.15169908106327057}
{"lp": "en-zh", "domain": "speech", "document_id": "test-en-speech_OPV8Gf1FFn8_021", "segment_id": 759, "is_bad_source": false, "source": "Mom says you don't want to visit us. She says that? Yeah. Everybody's got a story, son. I guess that's hers. Life's funny that way, you know?", "target": "妈妈说你不想来看我们？她真是这么说的？没错。每个人都有自己的故事，孩子。我想这就是她的故事吧。生活有时候就是这么搞笑，你知道吗？", "original_target": "妈妈说你不想来看我们。 她这么说的？ 对。 每个人都有自己的故事，孩子。我想那是她的故事。生活就是这么有意思，你知道吧？", "difficulty_score": 0.2372959405183792}
