{"lp": "en-de", "domain": "social", "document_id": "test-en-social_112289379466442912", "segment_id": 654, "is_bad_source": false, "source": "Does this make sense? Would this be useful?", "target": "Macht das Sinn? Wäre das hilfreich?", "original_target": "Macht das Sinn? Wäre das hilfreich?", "difficulty_score": 0.978634295645502}
{"lp": "en-nl", "domain": "social", "document_id": "test-en-social_112112980319428992", "segment_id": 418, "is_bad_source": false, "source": "I’m splurging on a new set of frames, these red ones I reeeeally like.", "target": "Ik ga veel geld uitgeven voor een nieuw montuur, die rode vind ik supergaaf.", "original_target": "Ik gooi wat geld stuk op een nieuwe set lijsten, die rode exemplaren vind ik héél mooi.", "difficulty_score": 0.889705547646031}
{"lp": "en-es", "domain": "social", "document_id": "test-en-social_112122127346453600", "segment_id": 459, "is_bad_source": false, "source": "Chapter five is a long one, but so fucking angsty. Yisssss, the good shit.", "target": "El capítulo cinco es largo, pero lleno de puta rabia. Sííí, mierda de la buena.", "original_target": "El capítulo cinco es largo, pero jodidamente rabioso. Síiii, mierda de la buena.", "difficulty_score": 0.8867048415662722}
{"lp": "en-zh", "domain": "news", "document_id": "test-en-news_newsweek.63908", "segment_id": 46, "is_bad_source": false, "source": "However, with that deadline just 9 days away, Senate Republican Leader Mitch McConnell has said Congress will need to pass a CR to keep things open, meaning the speaker may soon break a promise he made, largely to appease his right flank. Such a maneuver could ignite a heated ideological battle in a closely divided House over the GOP's role in spending cuts that may see the government face a partial shutdown or Johnson removed from his job.", "target": "然而，随着截止期限仅剩九天，参议院共和党领袖米奇·麦康奈尔表示，国会需要通过一项持续决议案以维持政府继续运作，这意味着众议院议长可能很快就会为了安抚右翼阵营而违反他所做的承诺。这种举动可能会在本就分歧严重的众议院中引发一场激烈的意识形态斗争，围绕共和党在削减开支方面的角色展开辩论，这可能导致政府面临部分关闭或约翰逊被免职。", "original_target": "但在距离截止期限只有九天之际，参议院共和党领袖米奇·麦康奈尔表示，国会需要通过一项持续决议案，来维持政府继续运作，这意味着众议院议长为了安抚右翼阵营，可能很快就会违背他做出的承诺。此策略可能会在原本分歧严重的众议院引发一场激烈的意识形态之争，争论的焦点是共和党在削减开支方面所扮演的角色，这可能会导致政府面临部分关门或约翰逊被免职。", "difficulty_score": 0.8307536984554013}
{"lp": "en-de", "domain": "news", "document_id": "test-en-news_scotsman.87519", "segment_id": 114, "is_bad_source": false, "source": "As has been pointed out for years by, among others, The Scotsman, the wrongful conviction of hundreds of Post Office branch managers in the Horizon scandal is one of the most serious miscarriages of justice in history. People were sent to prison, lost homes, marriages and reputations, and endured the mental torment of an honest person treated as a criminal.", "target": "Wie unter anderem durch den Scotsman seit Jahren betont wird, ist die ungerechtfertigte Verurteilung von Hunderten von Postfilialleitern im Horizon-Skandal eines der größten Justizirrtümer der Geschichte. Betroffene wurden ins Gefängnis gesteckt, verloren ihr Zuhause, ihre Ehen zerbrachen und ihr Ruf wurde zerstört. Sie mussten die psychischen Folgen tragen, als gesetzestreue Menschen wie Kriminelle behandelt worden zu sein.", "original_target": "Wie unter anderem durch den Scotsman seit Jahren betont wird, ist die ungerechtfertigte Verurteilung von Hunderten von Postfilialleitern im Horizon-Skandal einer der größten Justizirrtümer der Geschichte. Betroffene wurden ins Gefängnis gesteckt, verloren ihr Zuhause, ihre Ehen und ihr Ruf wurden zerstört und sie mussten die psychischen Folgen hinnehmen, als gesetzestreue Menschen wie Kriminelle behandelt zu werden.", "difficulty_score": 0.8733974714527591}
{"lp": "en-nl", "domain": "social", "document_id": "test-en-social_112122127346453600", "segment_id": 461, "is_bad_source": false, "source": "But no, I stand by it. Most natural speech is broken up, especially when people get emotional.", "target": "Maar nee, ik blijf bij mijn mening. De meeste natuurlijke spraak gaat hortend en stotend, vooral als mensen emotioneel worden.", "original_target": "Maar nee, ik blijf bij mijn mening. De meeste natuurlijke spraak gaat hortend en stotend, vooral als mensen emotioneel worden.", "difficulty_score": 0.916914749563271}
{"lp": "en-es", "domain": "social", "document_id": "test-en-social_112270350852000848", "segment_id": 630, "is_bad_source": false, "source": "We always start with a rough pencil sketch…", "target": "Siempre empezamos con un boceto básico a lápiz…", "original_target": "Siempre empezamos con un boceto general a lápiz...", "difficulty_score": 0.9640310039434654}
{"lp": "en-zh", "domain": "social", "document_id": "test-en-social_112166537145572640", "segment_id": 576, "is_bad_source": false, "source": "“get simple, semantic classes simply by using these two libraries and a build tool”", "target": "“只需使用这两个库和构建工具，即可获得简单的语义类”", "original_target": "“只需使用这两个组件库和构建工具就能获得简单的语义类”", "difficulty_score": 0.9554526818426765}
{"lp": "en-de", "domain": "news", "document_id": "test-en-news_economist.14223", "segment_id": 25, "is_bad_source": false, "source": "Thomas Puls of IW Köln fears that the strikes will harm the image of Germany as a place for business. Local bosses are already fretting about a German version of the gilets jaunes protests in France in 2018, which culminated in yellow-jacketed demonstrators torching cars on the Champs-Elysées and the police stepping in with tear gas. Jochen Kopelke, head of Germany's police union, warned in an interview with Tagesspiegel, a daily, that the farmers were probably \"just the start of an enormous wave of protest this year.\" Germany was the only big economy to shrink in 2023, and the year ended on an especially sour note, with an unexpected drop in business confidence in December. This year is shaping up to be even tougher.", "target": "Thomas Puls vom IW Köln befürchtet, dass die Streiks dem Image von Deutschland als Wirtschaftsstandort schaden könnten. Ansässige Unternehmer fürchten bereits eine deutsche Version der Gelbwestenproteste Frankreichs wie im Jahr 2018, die darin endeten, dass die Demonstranten Autos auf dem Champs-Élysées abfackelten und die Polizei mit Tränengas eingriff. Jochen Kopelke, Bundesvorsitzender der Gewerkschaft der Polizei, warnte in einem Interview mit dem Tagesspiegel: „Die Bauernproteste sind wahrscheinlich erst der Anfang einer riesigen Protestwelle, die in diesem Jahr auf uns zurollen wird“. Deutschland war die einzige der großen Wirtschaftsregionen, die 2023 schrumpften, und das Jahr endete mit einer besonders bitteren Note: einem unerwarteten Rückgang des Wirtschaftsvertrauens im Dezember. Dieses Jahr dürfte noch schwieriger werden.", "original_target": "Thomas Puls vom IW Köln befürchtet, dass die Streiks dem Image von Deutschland als Wirtschaftsstandort schaden könnten. Örtliche Unternehmer fürchten bereits eine deutsche Version der Proteste der „gilets jaunes“ in Frankreich 2018, die darin endeten, dass die Demonstranten in ihren gelben Westen Autos auf den Champs-Elysées abfackelten und die Polizei mit Tränengas eingriff. Jochen Kopelke, Bundesvorsitzender der Gewerkschaft der Polizei, warnte in einem Interview mit dem Tagesspiegel: „Die Bauernproteste sind wahrscheinlich erst der Anfang einer riesigen Protestwelle, die in diesem Jahr auf uns zurollen wird“. Deutschland war die einzige der großen Wirtschaftsregionen, die 2023 schrumpften, und das Jahr endete mit einer besonders bitteren Note: einem unerwarteten Rückgang des Wirtschaftsvertrauens im Dezember. Dieses Jahr lässt sich noch schwieriger an.", "difficulty_score": 0.7761779343374642}
{"lp": "en-nl", "domain": "speech", "document_id": "test-en-speech_33gJqN796Eo_000", "segment_id": 705, "is_bad_source": false, "source": "Well, it still sounds better than Pink Floyd. So in Manic Miner, you collect all the items on the screen and head to the goal. And you gotta do it before you run out of air or hit something. Hit what exactly? Weeds! You can die from touching grass. It sounds like half my fanbase. And did you notice I died from touching a weed that was on a completely different platform? I just went through the platform and then hit the weed. That's good game design, man. And then there's this asshole over here who's going rrrrr!", "target": "Nou, het klinkt nog steeds beter dan Pink Floyd. Dus in Manic Miner verzamel je alle items op het scherm en ga je richting het doel. En dat moet je door voordat je lucht op is of je iets raakt. Wat precies? Onkruid! Je kunt doodgaan als je gras aanraakt. Klinkt als de helft van mijn publiek. En heb je gezien dat ik doodging doordat ik onkruid aanraakte dat op een heel ander platform stond? Ik ging net door het platform heen en toen raakte ik het onkruid. Dat is nog eens een goed ontworpen game, man. En dan is er nog die eikel daar die rrrrr doet!", "original_target": "Nou, het klinkt nog steeds beter dan Pink Floyd. Dus in Manic Miner verzamel je alle items op het scherm en ga je richting het doel. En dat moet je door voordat je lucht op is of je iets raakt. Wat precies? Onkruid! Je kunt doodgaan als je gras aanraakt. Klinkt als de helft van mijn publiek. En heb je gezien dat ik doodging doordat ik onkruid aanraakte dat op een heel ander platform stond? Ik ging net door het platform heen en toen raakte ik het onkruid. Dat is nog eens een goed ontworpen game, man. En dan nog die klootzak daar die rrrrr doet!", "difficulty_score": 0.1875026876327152}
{"lp": "en-es", "domain": "news", "document_id": "test-en-news_beverly_press.3585", "segment_id": 5, "is_bad_source": false, "source": "The Tierra del Sol Gallery is located at 7414 Santa Monica Blvd. For information, visit tierradelsolgallery.org.", "target": "La galería Tierra del Sol se encuentra en el 7414 de Santa Mónica Blvd. Para más información, visita tierradelsolgallery.org.", "original_target": "La galería Tierra del Sol se encuentra en el 7414 de Santa Mónica Blvd. Para más información, visita tierradelsolgallery.org.", "difficulty_score": 0.9502909162196931}
{"lp": "en-zh", "domain": "literary", "document_id": "test-en-literary_forever_snow_chunk_1_words_993", "segment_id": 884, "is_bad_source": false, "source": "“Why are they doing this to her?”", "target": "“他们为什么要这样对她？”", "original_target": "“他们为什么要这样对她？”", "difficulty_score": 0.9764078236334355}
{"lp": "en-de", "domain": "speech", "document_id": "test-en-speech_OPV8Gf1FFn8_021", "segment_id": 759, "is_bad_source": false, "source": "Mom says you don't want to visit us. She says that? Yeah. Everybody's got a story, son. I guess that's hers. Life's funny that way, you know?", "target": "Mom sagt, du willst uns nicht besuchen. Das sagt sie? Ja. Jeder hat seine Geschichte, Junge. Das ist wohl ihre. Das Leben ist schon komisch, weißt du?", "original_target": "Mama sagt, du willst uns nicht besuchen. Das sagt sie? Ja. Jeder hat so seine Geschichte, Junge. Das ist wohl ihre. Das Leben ist schon komisch, was?", "difficulty_score": 0.910071777874252}
{"lp": "en-nl", "domain": "social", "document_id": "test-en-social_112226149509052560", "segment_id": 608, "is_bad_source": false, "source": "Final edit: that level turned out to be a tool assisted upload, which no one thought was possible at the time but apparently it was! But people still persisted and it got beat in the end! https://fgc.network/objects/0f1b42c6-cbb1-49bb-91f5-db81bc71ea14", "target": "Laatste update: dat level bleek een upload te zijn die met een tool gemaakt is, wat niemand toen ooit voor mogelijk hield, maar blijkbaar toch zo was. Maar mensen bleven volhouden en uiteindelijk is het verslagen! https://fgc.network/objects/0f1b42c6-cbb1-49bb-91f5-db81bc71ea14", "original_target": "Laatste nieuws: dat level bleek een upload te zijn die met een tool gemaakt is, wat niemand toen ooit voor mogelijk hield maar uiteindelijk toch zo was. Maar mensen bleven volhouden en uiteindelijk is het verslagen! https://fgc.network/objects/0f1b42c6-cbb1-49bb-91f5-db81bc71ea14", "difficulty_score": 0.679705174420054}
{"lp": "en-es", "domain": "literary", "document_id": "test-en-literary_forever_snow_chunk_2_words_986", "segment_id": 927, "is_bad_source": false, "source": "“Well I didn’t.” Ivory found the art supplies on their list and put it in a crate that they found. “And I’m not a girl.”", "target": "“Pues yo no”. Ivory encontró el material de su lista y lo puso en un cajón que había por allí. “Y no soy una chica”.", "original_target": "\"Pues yo no\". Ivory encontró el material de su lista y lo puso en un cajón que había por allí. \"Y no soy una chica\".", "difficulty_score": 0.8697175094826397}
{"lp": "en-zh", "domain": "social", "document_id": "test-en-social_111977766001055104", "segment_id": 226, "is_bad_source": false, "source": "Moon landing time (about an hour to go) https://plus.nasa.gov/scheduled-video/intuitive-machines-1-lunar-landing/", "target": "登月时间（还有大约1小时）https://plus.nasa.gov/scheduled-video/intuitive-machines-1-lunar-landing/", "original_target": "登月时间（倒计时约1小时）https://plus.nasa.gov/scheduled-video/intuitive-machines-1-lunar-landing/", "difficulty_score": 0.888435040536286}
{"lp": "en-de", "domain": "social", "document_id": "test-en-social_112109186993725712", "segment_id": 281, "is_bad_source": false, "source": "This is the state of my upstairs bathroom right now.", "target": "So sieht grad mein Badezimmer im Obergeschoss aus.", "original_target": "So sieht gerade mein Badezimmer im Obergeschoss aus.", "difficulty_score": 0.9574094603160765}
{"lp": "en-nl", "domain": "social", "document_id": "test-en-social_112140958167999904", "segment_id": 481, "is_bad_source": false, "source": "It's my first ever crown dentist visit: Prep today, then fitting in a fortnight. I'm practising opening my mouth wide.", "target": "Dit is mijn eerste bezoek ooit aan een implantoloog: vandaag voorbereiden en over twee weken passen. Ik ben aan het oefenen hoe ik mijn mond wijd open kan houden.", "original_target": "Dit is mijn eerste bezoek ooit aan een implantoloog: vandaag voorbereiden en over twee weken passen. Ik ben aan het oefenen hoe ik mijn mond wijd open kan houden.", "difficulty_score": 0.7999265249827369}
{"lp": "en-es", "domain": "news", "document_id": "test-en-news_scotsman.87445", "segment_id": 81, "is_bad_source": false, "source": "If anyone dares to say that Scotland's NHS is not in a state of crisis or that these are just the usual winter problems, we should be outraged. The danger is that politicians like the embattled Health Secretary, Michael Matheson, will succeed in their efforts to convince us that, while regrettable, this is somehow acceptable, that there is nothing more that ministers can do in the circumstances, that this is the new normal.", "target": "Si alguien se atreve a decir que el NHS de Escocia no se encuentra en crisis o que esto es simplemente debido a los problemas habituales del invierno, deberíamos indignarnos. El peligro radica en que políticos como el acosado Secretario de Salud, Michael Matheson, tengan éxito en su intento para convencernos de que, aunque lamentable, esto es de alguna manera aceptable, que no hay mucho que puedan hacer los ministros en estas circunstancias, que esta es la nueva normalidad.", "original_target": "Si alguien se atreve a decir que el NHS de Escocia no se encuentra en crisis o que esto es simplemente debido a los problemas habituales del invierno, deberíamos indignarnos. El peligro radica en que políticos como el acosado Secretario de Sanidad, Michael Matheson, tengan éxito en su intento para convencernos de que, aunque lamentable, esto es de alguna manera aceptable, que no hay mucho que puedan hacer los ministros en estas circunstancias, que ésta es la nueva normalidad.", "difficulty_score": 0.8899825259458501}
{"lp": "en-zh", "domain": "speech", "document_id": "test-en-speech_OPV8Gf1FFn8_021", "segment_id": 759, "is_bad_source": false, "source": "Mom says you don't want to visit us. She says that? Yeah. Everybody's got a story, son. I guess that's hers. Life's funny that way, you know?", "target": "妈妈说你不想来看我们？她真是这么说的？没错。每个人都有自己的故事，孩子。我想这就是她的故事吧。生活有时候就是这么搞笑，你知道吗？", "original_target": "妈妈说你不想来看我们。 她这么说的？ 对。 每个人都有自己的故事，孩子。我想那是她的故事。生活就是这么有意思，你知道吧？", "difficulty_score": 0.910071777874252}
